# SetDLSeparation

## Description
Sets the Double Line Preferences separation.

```pascal
PROCEDURE SetDLSeparation(separationDistance : REAL);
```

```python
def vs.SetDLSeparation(separationDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|separationDistance|REAL|The separation.|

## Remarks
CJG 6-27-06

## Examples
```pascal
SetDLSeparation(1.0);
```
```python
import vs

# Sets the Double Line Preferences separation.
separationDistance = 1.0

vs.SetDLSeparation(separationDistance)
```

## See Also
VS Functions:
GetDLSeparation

## Version
Availability: from VectorWorks12.5

## Category
* Document Settings